# 序列：列表、元组和字符串都成为序列。分可变序列（数组）和不可变序列（元组和字符串）
# 1. 能运用到序列的运算符只有+和*，+表示序列拼接，*表示将序列进行重复，即拷贝
# 2. 同一性运算符is、is not。判断两个对象是不是同一个对象，即id是否相同
sss = (1,2)
print(id(sss))  # 4507466184
sss *= 2
print(id(sss))  # 4507820504    元组运算后变成另一个对象

sss = [1,2]
print(id(sss))  # 4346638152
sss *= 2
print(id(sss))  # 4346638152    数组运算后还是原对象

# 3. in和not in。判断某个元素是否包含在序列中
print("a" in 'abc') # True
print("a" not in 'abc') # False

x = 123
del x   # 彻底删除一个元素，再访问他会报错
# print(x)    # NameError: name 'x' is not defined
x = [1,2,3,4,5]
del x[1:4]   # 等同于 x[1:4] = []，切片也可以完成
del x[::2]  # 不等同于 x[::2] = []，会报错，数组不能做这种操作
del x[:]    # 清空一个数组，等同于 x.clear()

# 4. 与序列相关的函数。数量相当多
# 4.1 数组、元组和字符串相互转换
